export const SITE = {
  title: 'Deep Learning Specialization',
  description: 'Deep Learning Specialization',
  defaultLanguage: 'en-us'
} as const

export const OPEN_GRAPH = {
  image: {
    src: 'default-og-image.png',
    alt:
      'astro logo on a starry expanse of space,' +
      ' with a purple saturn-like planet floating in the right foreground'
  },
  twitter: 'astrodotbuild'
}

export const KNOWN_LANGUAGES = {
  Korean: 'ko'
} as const
export const KNOWN_LANGUAGE_CODES = Object.values(KNOWN_LANGUAGES)

export const EDIT_URL = `https://github.com/advanced-astro/astro-docs-template/tree/main`

export const COMMUNITY_INVITE_URL = `https://astro.build/chat`

// See "Algolia" section of the README for more information.
export const ALGOLIA = {
  indexName: 'XXXXXXXXXX',
  appId: 'XXXXXXXXXX',
  apiKey: 'XXXXXXXXXX'
}

export type Sidebar = Record<
  (typeof KNOWN_LANGUAGE_CODES)[number],
  Record<string, Record<string, { text: string; link: string }[]>>
>
export const SIDEBAR: Sidebar = {
  ko: {
    '신경망 및 딥 러닝': {
      '딥 러닝 소개': [
        { text: '신경망이란 무엇인가요', link: '/ko/1_신경망_및_딥_러닝/01_딥_러닝_소개/01_신경망이란_무엇인가요' },
        { text: '이 과정 정보', link: '/ko/1_신경망_및_딥_러닝/01_딥_러닝_소개/02_이_과정_정보' },
        { text: '신경망을 이용한 지도 학습', link: '/ko/1_신경망_및_딥_러닝/01_딥_러닝_소개/03_신경망을_이용한_지도_학습' },
        { text: '딥러닝이 떠오르는 이유는 무엇인가요', link: '/ko/1_신경망_및_딥_러닝/01_딥_러닝_소개/04_딥러닝이_떠오르는_이유는_무엇인가요' },
      ],
      '신경망 기초': [
        { text: '이진 분류', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/01_이진_분류' },
        { text: '로지스틱 회귀', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/02_로지스틱_회귀' },
        { text: '로지스틱 회귀와 비용 함수', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/03_로지스틱_회귀와_비용_함수' },
        { text: '경사 하강법', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/04_경사_하강법' },
        { text: '미분', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/05_미분' },
        { text: '더 많은 미분 예제', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/06_더_많은_미분_예제' },
        { text: '계산 그래프', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/07_계산_그래프' },
        { text: '계산 그래프가 있는 미분', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/08_계산_그래프가_있는_미분' },
        { text: '로지스틱 회귀 경사 하강법', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/09_로지스틱_회귀_경사_하강법' },
        { text: 'm개 예제의 경사 하강법', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/10_m개_예제의_경사_하강법' },
        { text: '벡터화', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/11_벡터화' },
        { text: '더 많은 벡터화 예제', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/12_더_많은_벡터화_예제' },
        { text: '로지스틱 회귀 벡터화', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/13_로지스틱_회귀_벡터화' },
        { text: '로지스틱 회귀의 그라데이션 출력 벡터화', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/14_로지스틱_회귀의_그라데이션_출력_벡터화' },
        { text: '벡터 브로드캐스팅', link: '/ko/1_신경망_및_딥_러닝/02_신경망_기초/15_벡터_브로드캐스팅' },
      ],
      '얕은 신경망': [
        { text: '신경망 개요', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/01_신경망_개요' },
        { text: '신경망 표현', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/02_신경망_표현' },
        { text: '신경망의 출력 계산하기', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/03_신경망의_출력_계산하기' },
        { text: '여러 예제에서 백터화 하기', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/04_여러_예제에서_백터화_하기' },
        { text: '벡터화된 구현에 대한 설명', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/05_벡터화된_구현에_대한_설명' },
        { text: '활성화 기능', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/06_활성화_기능' },
        { text: '비선형 활성화 함수가 필요한 이유', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/07_비선형_활성화_함수가_필요한_이유' },
        { text: '활성화 함수의 도함수', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/08_활성화_함수의_도함수' },
        { text: '신경망을 위한 그라데이션 하강', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/09_신경망을_위한_그라데이션_하강' },
        { text: '무작위 초기화', link: '/ko/1_신경망_및_딥_러닝/03_얕은_신경망/11_무작위_초기화' },
      ],
      '심층 신경망': [
        { text: '심층 L-레이어 신경망', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/01_심층_L-레이어_신경망' },
        { text: '딥 네트워크의 순방향 전파', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/02_딥_네트워크의_순방향_전파' },
        { text: '올바른 매트릭스 크기 설정하기', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/03_올바른_매트릭스_크기_설정하기' },
        { text: '심층 표현이 필요한 이유는', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/04_심층_표현이_필요한_이유는' },
        { text: '신층 신경망의 빌딩 블록', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/05_신층_신경망의_빌딩_블록' },
        { text: '순방향 및 역방향 전파', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/06_순방향_및_역방향_전파' },
        { text: '매개변수 대 하이퍼파라미터', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/07_매개변수_대_하이퍼파라미터' },
        { text: '이것이 뇌와 어떤 관련이 있을까요', link: '/ko/1_신경망_및_딥_러닝/04_심층_신경망/08_이것이_뇌와_어떤_관련이_있을까요' },
      ],
    },
    '심층 신경망 개선': {
      '딥 러닝의 실용적인 측면': [
        { text: '교육 개발 테스트 세트', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/01_교육_개발_테스트_세트' },
        { text: '바이어스 분산', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/02_바이어스_분산' },
        { text: '머신러닝을 위한 기본 레시피', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/03_머신러닝을_위한_기본_레시피' },
        { text: '정규화', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/04_정규화' },
        { text: '정규화가 과적합을 줄이는 이유는 무엇인가요', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/05_정규화가_과적합을_줄이는_이유는_무엇인가요' },
        { text: '드롭아웃 정규화', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/06_드롭아웃_정규화' },
        { text: '드롭아웃 이해', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/07_드롭아웃_이해' },
        { text: '기타 정규화 방법', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/08_기타_정규화_방법' },
        { text: '입력 정규화', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/09_입력_정규화' },
        { text: '소실 폭발 그라데이션', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/10_소실_폭발_그라데이션' },
        { text: '딥 네트워크를 위한 가중치 초기화', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/11_딥_네트워크를_위한_가중치_초기화' },
        { text: '그라데이션의 수치 근사치 계산', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/12_그라데이션의_수치_근사치_계산' },
        { text: '그라데이션 확인', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/13_그라데이션_확인' },
        { text: '그라데이션 확인 구현 노트', link: '/ko/2_심층_신경망_개선/05_딥_러닝의_실용적인_측면/14_그라데이션_확인_구현_노트' },
      ],
      '최적화 알고리즘': [
        { text: '미니 배치 그라데이션 하강', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/01_미니_배치_그라데이션_하강' },
        { text: '미니 배치 그라데이션 하강 이해', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/02_미니_배치_그라데이션_하강_이해' },
        { text: '지수 가중 평균', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/03_지수_가중_평균' },
        { text: '지수 가중 평균 이해하기', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/04_지수_가중_평균_이해하기' },
        { text: '지수 가중 평균의 편향성 보정', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/05_지수_가중_평균의_편향성_보정' },
        { text: '모멘텀이 있는 그라데이션 하강', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/06_모멘텀이_있는_그라데이션_하강' },
        { text: 'RMSprop', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/07_RMSprop' },
        { text: '아담 최적화 알고리즘', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/08_아담_최적화_알고리즘' },
        { text: '학습률 감소', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/09_학습률_감소' },
        { text: '로컬 옵티마의 문제', link: '/ko/2_심층_신경망_개선/06_최적화_알고리즘/10_로컬_옵티마의_문제' },
      ],
      '하이퍼 파라미터 튜닝': [
        { text: '튜닝 프로세스', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/01_튜닝_프로세스' },
        { text: '적절한 척도를 사용하여 하이퍼 파라미터 선태', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/02_적절한_척도를_사용하여_하이퍼_파라미터_선태' },
        { text: '실제 하이퍼 파라미터 튜닝 팬더 대 캐비어', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/03_실제_하이퍼_파라미터_튜닝_팬더_대_캐비어' },
        { text: '네트워크에서 활성화 정규화', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/04_네트워크에서_활성화_정규화' },
        { text: '배치 노름을 신경망에 맞추기', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/05_배치_노름을_신경망에_맞추기' },
        { text: '배치 규범이 작동하는 이유는 무엇인가요', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/06_배치_규범이_작동하는_이유는_무엇인가요' },
        { text: '테스트 시 배치 표준', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/07_테스트_시_배치_표준' },
        { text: '소프트맥스 회귀', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/08_소프트맥스_회귀' },
        { text: '소프트맥스 분류기 훈련', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/09_소프트맥스_분류기_훈련' },
        { text: '딥러닝 프레임워크', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/10_딥러닝_프레임워크' },
        { text: '텐서플로', link: '/ko/2_심층_신경망_개선/07_하이퍼_파라미터_튜닝/11_텐서플로' },
      ],
    },
    '머신 러닝 프로젝트 구조화': {
      'ML 전략 1': [
        { text: '단일 숫자 평가 지표', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/01_단일_숫자_평가_지표' },
        { text: '지표 만족 및 최적화', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/02_지표_만족_및_최적화' },
        { text: '훈련 개발 테스트 배포', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/03_훈련_개발_테스트_배포' },
        { text: '개발 및 테스트 세트의 크기', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/04_개발_및_테스트_세트의_크기' },
        { text: '개발 테스트 세트 및 메트릭은 언제 변경해야', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/05_개발_테스트_세트_및_메트릭은_언제_변경해야' },
        { text: '왜 인간 수준의 성능인가', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/06_왜_인간_수준의_성능인가' },
        { text: '피할 수 있는 바이어스', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/07_피할_수_있는_바이어스' },
        { text: '인간 수준의 성능 이해', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/08_인간_수준의_성능_이해' },
        { text: '인간을 능가하는 성능', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/09_인간을_능가하는_성능' },
        { text: '모델 성능 향상', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/10_모델_성능_향상' },
        { text: '직교화', link: '/ko/3_머신_러닝_프로젝트_구조화/08_ML_전략_1/11_직교화' },
      ],
      'ML 전략 2': [
        { text: '오류 분석 수행', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/01_오류_분석_수행' },
        { text: '잘못 레이블이 지정된 데이터 정리', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/02_잘못_레이블이_지정된_데이터_정리' },
        { text: '첫 번째 시스템을 빠르게 구축한 다음 반복ᄒ', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/03_첫_번째_시스템을_빠르게_구축한_다음_반복ᄒ' },
        { text: '다양한 배포판에 대한 훈련 및 테스트', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/04_다양한_배포판에_대한_훈련_및_테스트' },
        { text: '일치하지 않는 데이터 분포의 편향 및 분산', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/05_일치하지_않는_데이터_분포의_편향_및_분산' },
        { text: '데이터 불일치 해결', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/06_데이터_불일치_해결' },
        { text: '전이 학습', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/07_전이_학습' },
        { text: '멀티태스크 학습', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/08_멀티태스크_학습' },
        { text: '엔드투엔드 딥러닝이란 무엇인가요', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/09_엔드투엔드_딥러닝이란_무엇인가요' },
        { text: '엔드투엔드 딥러닝 사용 여부', link: '/ko/3_머신_러닝_프로젝트_구조화/09_ML_전략_2/10_엔드투엔드_딥러닝_사용_여부' },
      ],
    },
    '컨볼루션 신경망': {
      '컨볼루션 신경망의 기초': [
        { text: '컴퓨터 비전', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/01_컴퓨터_비전' },
        { text: '엣지 감지 예시', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/02_엣지_감지_예시' },
        { text: '더 많은 엣지 감지', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/03_더_많은_엣지_감지' },
        { text: '패딩', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/04_패딩' },
        { text: '스트라이드 컨볼루션', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/05_스트라이드_컨볼루션' },
        { text: '볼륨의 따른 컨볼루션', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/06_볼륨의_따른_컨볼루션' },
        { text: '컨볼루션 네트워크의 한 계층', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/07_컨볼루션_네트워크의_한_계층' },
        { text: '간단한 컨볼루션 네트워크 예시', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/08_간단한_컨볼루션_네트워크_예시' },
        { text: '풀링 레이어', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/09_풀링_레이어' },
        { text: 'CNN 예시', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/10_CNN_예시' },
        { text: '왜 컨볼루션인가', link: '/ko/4_컨볼루션_신경망/10_컨볼루션_신경망의_기초/11_왜_컨볼루션인가' },
      ],
      '심층 컨볼루션 모델 사례 연구': [
        { text: '사례 연구를 살펴보는 이유는 무엇인가요', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/01_사례_연구를_살펴보는_이유는_무엇인가요' },
        { text: '클래식 네트워크', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/02_클래식_네트워크' },
        { text: 'ResNets', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/03_ResNets' },
        { text: 'ResNet이 필요한 이유는', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/04_ResNet이_필요한_이유는' },
        { text: '네트워크와 1x1 컨볼루션의 네트워크', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/05_네트워크와_1x1_컨볼루션의_네트워크' },
        { text: '인셉션 네트워크 동기부여', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/06_인셉션_네트워크_동기부여' },
        { text: '인셉션 네트워크', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/07_인셉션_네트워크' },
        { text: '모바일넷', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/08_모바일넷' },
        { text: '모바일넷 아키텍쳐', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/09_모바일넷_아키텍쳐' },
        { text: 'EfficientNet', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/10_EfficientNet' },
        { text: '오픈 소스 구현 사용', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/11_오픈_소스_구현_사용' },
        { text: '전이 학습', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/12_전이_학습' },
        { text: '데이터 증강', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/13_데이터_증강' },
        { text: '컴퓨터 비전 현황', link: '/ko/4_컨볼루션_신경망/11_심층_컨볼루션_모델_사례_연구/14_컴퓨터_비전_현황' },
      ],
      '물체 감지': [
        { text: '개체 현지화', link: '/ko/4_컨볼루션_신경망/12_물체_감지/01_개체_현지화' },
        { text: '랜드마크 감지', link: '/ko/4_컨볼루션_신경망/12_물체_감지/02_랜드마크_감지' },
        { text: '물체 감지', link: '/ko/4_컨볼루션_신경망/12_물체_감지/03_물체_감지' },
        { text: '슬라이딩 윈도우의 컨볼루션 구현', link: '/ko/4_컨볼루션_신경망/12_물체_감지/04_슬라이딩_윈도우의_컨볼루션_구현' },
        { text: '바운딩 박스 예측', link: '/ko/4_컨볼루션_신경망/12_물체_감지/05_바운딩_박스_예측' },
        { text: '유니온을 통한 교차점', link: '/ko/4_컨볼루션_신경망/12_물체_감지/06_유니온을_통한_교차점' },
        { text: 'Non-max 억제', link: '/ko/4_컨볼루션_신경망/12_물체_감지/07_Non-max_억제' },
        { text: '앵커 박스', link: '/ko/4_컨볼루션_신경망/12_물체_감지/08_앵커_박스' },
        { text: 'YOLO 알고리즘', link: '/ko/4_컨볼루션_신경망/12_물체_감지/09_YOLO_알고리즘' },
        { text: '영역 제안', link: '/ko/4_컨볼루션_신경망/12_물체_감지/10_영역_제안' },
        { text: 'U-Net을 사용한 시멘틱 세분화', link: '/ko/4_컨볼루션_신경망/12_물체_감지/11_U-Net을_사용한_시멘틱_세분화' },
        { text: '컨볼루션 트랜스페이스', link: '/ko/4_컨볼루션_신경망/12_물체_감지/12_컨볼루션_트랜스페이스' },
        { text: 'U-Net 아키텍쳐 직관', link: '/ko/4_컨볼루션_신경망/12_물체_감지/13_U-Net_아키텍쳐_직관' },
        { text: 'U-Net 아키텍쳐', link: '/ko/4_컨볼루션_신경망/12_물체_감지/14_U-Net_아키텍쳐' },
      ],
      '특수 어플리케이션 얼굴 인식 및 신경 스타일 전송': [
        { text: '얼굴 인식이란 무엇인가요', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/01_얼굴_인식이란_무엇인가요' },
        { text: '원샷 학습', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/02_원샷_학습' },
        { text: 'Siamese 네트워크', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/03_Siamese_네트워크' },
        { text: '삼중항 손실', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/04_삼중항_손실' },
        { text: '얼굴 인증 및 이진 분류', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/05_얼굴_인증_및_이진_분류' },
        { text: 'Neural Style Transfer란 무엇인가요', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/06_Neural_Style_Transfer란_무엇인가요' },
        { text: '딥 컨브넷 학습이란 무엇인가요', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/07_딥_컨브넷_학습이란_무엇인가요' },
        { text: '비용 함수', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/08_비용_함수' },
        { text: '컨텐츠 비용 함수', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/09_컨텐츠_비용_함수' },
        { text: '스타일 비용 함수', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/10_스타일_비용_함수' },
        { text: '1D 및 3D 일반화', link: '/ko/4_컨볼루션_신경망/13_특수_어플리케이션_얼굴_인식_및_신경_스타일_전송/11_1D_및_3D_일반화' },
      ],
    },
    '시퀀스 모델': {
      '순환 신경망': [
        { text: '왜 시퀀스 모델인가', link: '/ko/5_시퀀스_모델/14_순환_신경망/01_왜_시퀀스_모델인가' },
        { text: '표기법', link: '/ko/5_시퀀스_모델/14_순환_신경망/02_표기법' },
        { text: '순환 신경망 모델', link: '/ko/5_시퀀스_모델/14_순환_신경망/03_순환_신경망_모델' },
        { text: '시간 경과에 따른 역전파', link: '/ko/5_시퀀스_모델/14_순환_신경망/04_시간_경과에_따른_역전파' },
        { text: '다양한 유형의 RNN', link: '/ko/5_시퀀스_모델/14_순환_신경망/05_다양한_유형의_RNN' },
        { text: '언어 모델 및 시퀀스 생성', link: '/ko/5_시퀀스_모델/14_순환_신경망/06_언어_모델_및_시퀀스_생성' },
        { text: '소셜 시퀀스 샘플링', link: '/ko/5_시퀀스_모델/14_순환_신경망/07_소셜_시퀀스_샘플링' },
        { text: 'RNN 에서의 기울기 소실', link: '/ko/5_시퀀스_모델/14_순환_신경망/08_RNN_에서의_기울기_소실' },
        { text: '게이트 리커런트 유닛', link: '/ko/5_시퀀스_모델/14_순환_신경망/09_게이트_리커런트_유닛' },
        { text: '장단기 메모리 (LSTM)', link: '/ko/5_시퀀스_모델/14_순환_신경망/10_장단기_메모리_(LSTM)' },
        { text: '양방향 RNN', link: '/ko/5_시퀀스_모델/14_순환_신경망/11_양방향_RNN' },
        { text: '딥 RNN', link: '/ko/5_시퀀스_모델/14_순환_신경망/12_딥_RNN' },
      ],
      '자연어 처리 및 단어 임베딩': [
        { text: '단어 표현', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/01_단어_표현' },
        { text: '워드 임베딩 사용', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/02_워드_임베딩_사용' },
        { text: '단어 임베딩의 속성', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/03_단어_임베딩의_속성' },
        { text: '임베딩 매트릭스', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/04_임베딩_매트릭스' },
        { text: '단어 임베딩 학습하기', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/05_단어_임베딩_학습하기' },
        { text: 'Word2Vec', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/06_Word2Vec' },
        { text: '네거티브 샘플링', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/07_네거티브_샘플링' },
        { text: '글로브 워드 벡터', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/08_글로브_워드_벡터' },
        { text: '감정 분류', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/09_감정_분류' },
        { text: '단어 임베딩 편향성 제거', link: '/ko/5_시퀀스_모델/15_자연어_처리_및_단어_임베딩/10_단어_임베딩_편향성_제거' },
      ],
      '시퀀스 모델 및 주의 매커니즘': [
        { text: '기본 모델', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/01_기본_모델' },
        { text: '가장 가능성이 높은 문장 선택하기', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/02_가장_가능성이_높은_문장_선택하기' },
        { text: '빔 검색', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/03_빔_검색' },
        { text: '빔 검색 개선사항', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/04_빔_검색_개선사항' },
        { text: '블루 스코어', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/05_블루_스코어' },
        { text: '주의 모델 직관', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/06_주의_모델_직관' },
        { text: '주의 모델', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/07_주의_모델' },
        { text: '음성 인식', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/08_음성_인식' },
        { text: '트리거 단어 감지', link: '/ko/5_시퀀스_모델/16_시퀀스_모델_및_주의_매커니즘/09_트리거_단어_감지' },
      ],
      '트랜스포머 네트워크': [
        { text: '트랜스포머 네트워크 직관', link: '/ko/5_시퀀스_모델/17_트랜스포머_네트워크/01_트랜스포머_네트워크_직관' },
        { text: '자기 주의', link: '/ko/5_시퀀스_모델/17_트랜스포머_네트워크/02_자기_주의' },
        { text: '멀티 헤드 주의', link: '/ko/5_시퀀스_모델/17_트랜스포머_네트워크/03_멀티_헤드_주의' },
        { text: '트랜스포머 네트워크', link: '/ko/5_시퀀스_모델/17_트랜스포머_네트워크/04_트랜스포머_네트워크' },
      ],
    },
  }
};
